import os
import json
import numpy as np
import copy
from collections import OrderedDict
from rainbowarena.games.ticket2ride.card import Ticket2RideTicketCard

"""
颜色:
【0】彩
【1】黄
【2】绿
【3】蓝
【4】粉
【5】白
【6】橙
【7】红
【8】黑
【9】不限制
"""
"""
【0】Vancouver
【1】Seattle
【2】Portland
【3】San Francisco
【4】Los Angeles
【5】Calcary
【6】Helena
【7】Salt Lake City
【8】Las Vegas
【9】Phoenix
【10】Winnipec
【11】Denver
【12】Santafe
【13】El Paso
【14】Sault St Marie
【15】Duluth
【16】Omaha
【17】Kansas City
【18】Oklahoma City
【19】Dallas
【20】Houston
【21】Montreal
【22】Toronto
【23】Chicago
【24】Saint Louis
【25】Little Rock
【26】New Orleans
【27】Boston
【28】New York
【29】Pittsburch
【30】Nashville
【31】Atlanta
【32】Miami
【33】Washington
【34】Raleich
【35】Charleston
"""

# 线路
LINES = [
    [0, 1, 9, 0, 1, 0, 1],
    [1, 1, 9, 0, 1, 0, 1],
    [2, 3, 9, 0, 5, 0, 0],
    [3, 1, 9, 1, 2, 0, 1],
    [4, 1, 9, 1, 2, 0, 1],
    [5, 4, 9, 1, 5, 0, 0],
    [6, 6, 1, 1, 6, 0, 0],
    [7, 5, 2, 2, 3, 0, 1],
    [8, 5, 4, 2, 3, 0, 1],
    [9, 6, 3, 2, 7, 0, 0],
    [10, 3, 1, 3, 4, 0, 1],
    [11, 3, 4, 3, 4, 0, 1],
    [12, 5, 6, 3, 7, 0, 1],
    [13, 5, 5, 3, 7, 0, 1],
    [14, 2, 9, 4, 8, 0, 0],
    [15, 3, 9, 4, 9, 0, 0],
    [16, 6, 8, 4, 13, 0, 0],
    [17, 6, 5, 5, 10, 0, 0],
    [18, 4, 9, 5, 6, 0, 0],
    [19, 4, 3, 6, 10, 0, 0],
    [20, 6, 6, 6, 15, 0, 0],
    [21, 5, 7, 6, 16, 0, 0],
    [22, 4, 2, 6, 11, 0, 0],
    [23, 3, 4, 5, 7, 0, 0],
    [24, 3, 7, 7, 11, 0, 1],
    [25, 3, 1, 7, 11, 0, 1],
    [26, 3, 6, 7, 8, 0, 0],
    [27, 5, 5, 9, 11, 0, 0],
    [28, 3, 9, 9, 12, 0, 0],
    [29, 3, 9, 9, 13, 0, 0],
    [30, 6, 9, 10, 14, 0, 0],
    [31, 4, 8, 10, 15, 0, 0],
    [32, 4, 4, 11, 16, 0, 0],
    [33, 4, 8, 11, 17, 0, 1],
    [34, 4, 6, 11, 17, 0, 1],
    [35, 4, 7, 11, 18, 0, 0],
    [36, 2, 9, 11, 12, 0, 0],
    [37, 3, 3, 12, 18, 0, 0],
    [38, 2, 9, 12, 13, 0, 0],
    [39, 5, 1, 13, 18, 0, 0],
    [40, 4, 7, 13, 19, 0, 0],
    [41, 3, 2, 13, 20, 0, 0],
    [42, 5, 8, 14, 21, 0, 0],
    [43, 3, 9, 14, 15, 0, 0],
    [44, 2, 9, 14, 22, 0, 0],
    [45, 6, 4, 15, 22, 0, 0],
    [46, 3, 7, 15, 23, 0, 0],
    [47, 2, 9, 15, 16, 0, 1],
    [48, 2, 9, 15, 16, 0, 1],
    [49, 4, 3, 16, 23, 0, 0],
    [50, 1, 9, 16, 17, 0, 1],
    [51, 1, 9, 16, 17, 0, 1],
    [52, 2, 3, 17, 24, 0, 1],
    [53, 2, 4, 17, 24, 0, 1],
    [54, 2, 9, 17, 18, 0, 1],
    [55, 2, 9, 17, 18, 0, 1],
    [56, 2, 9, 18, 25, 0, 0],
    [57, 2, 9, 18, 19, 0, 1],
    [58, 2, 9, 18, 19, 0, 1],
    [59, 2, 9, 19, 25, 0, 0],
    [60, 1, 9, 19, 20, 0, 1],
    [61, 1, 9, 19, 20, 0, 1],
    [62, 2, 9, 20, 26, 0, 0],
    [63, 2, 9, 21, 27, 0, 1],
    [64, 2, 9, 21, 27, 0, 1],
    [65, 3, 3, 21, 28, 0, 0],
    [66, 3, 9, 21, 22, 0, 0],
    [67, 4, 5, 22, 23, 0, 0],
    [68, 2, 9, 22, 29, 0, 0],
    [69, 2, 2, 23, 24, 0, 1],
    [70, 2, 5, 23, 24, 0, 1],
    [71, 3, 6, 23, 29, 0, 1],
    [72, 3, 8, 23, 29, 0, 1],
    [73, 2, 9, 24, 25, 0, 0],
    [74, 2, 9, 24, 30, 0, 0],
    [75, 5, 2, 24, 29, 0, 0],
    [76, 3, 5, 25, 30, 0, 0],
    [77, 3, 2, 25, 26, 0, 0],
    [78, 4, 1, 26, 31, 0, 1],
    [79, 4, 6, 26, 31, 0, 1],
    [80, 6, 6, 26, 32, 0, 0],
    [81, 2, 1, 27, 28, 0, 1],
    [82, 2, 1, 27, 28, 0, 1],
    [83, 2, 5, 28, 29, 0, 1],
    [84, 2, 2, 28, 29, 0, 1],
    [85, 2, 6, 28, 33, 0, 1],
    [86, 2, 8, 28, 33, 0, 1],
    [87, 4, 1, 29, 30, 0, 0],
    [88, 2, 9, 29, 34, 0, 0],
    [89, 2, 9, 29, 33, 0, 0],
    [90, 3, 8, 30, 34, 0, 0],
    [91, 1, 9, 30, 31, 0, 0],
    [92, 2, 9, 31, 34, 0, 1],
    [93, 2, 9, 31, 34, 0, 1],
    [94, 2, 9, 31, 35, 0, 0],
    [95, 5, 3, 31, 32, 0, 0],
    [96, 4, 4, 32, 35, 0, 0],
    [97, 2, 9, 33, 34, 0, 1],
    [98, 2, 9, 33, 34, 0, 1],
    [99, 2, 9, 34, 35, 0, 0]
]

# 线路索引
LINE_INDEX = []
ACTION_LINE = []
idx = 0
for line in LINES:
    if line[2] < 9:
        LINE_INDEX.append(idx)
        ACTION_LINE.append(line[0])
        idx += 1
    else:
        LINE_INDEX.append(idx)
        ACTION_LINE.extend([line[0]] * 8)
        idx += 8

# 地图
CITY_MAP = [[[]] * 36] * 36
for line in LINES:
    CITY_MAP[line[3]][line[4]].append(line[0])
    CITY_MAP[line[4]][line[3]].append(line[0])

# 车票
TICKET_CARDS = [
    [11, 13, 4],
    [],
]


def init_board_map():
    '''
    地图 包含两部分：
    ① 每条线路记录: 0.索引, 1.长度, 2.颜色, 3.起点, 4.终点, 5.是否被占用, 6.是否双线 
    ② map: 不同站点之间的连接
    '''
    board_map_part1 = LINES
    board_map_part2 = CITY_MAP
    board_map = [board_map_part1, board_map_part2]
    return board_map


def init_lines():
    '''
    初始化玩家的初始线路
    '''
    lines = copy.deepcopy(LINES)
    line_index = LINE_INDEX
    action_line = ACTION_LINE

    return lines, line_index, action_line


def init_train_car_cards():
    '''
    车厢卡
    '''
    train_car_cards = [0] * 14 + [1] * 12 + [2] * 12 \
                      + [3] * 12 + [4] * 12 + [5] * 12 \
                      + [6] * 12 + [7] * 12 + [8] * 12
    return train_car_cards


def init_ticket_cards():
    '''
    车票卡
    '''
    ticket_cards = [Ticket2RideTicketCard(ticket_card[0], ticket_card[1], ticket_card[2]) \
                    for ticket_card in TICKET_CARDS]
    return ticket_cards
